#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <string.h>
//int num = 10;
//int main()
//{
//    int num = 1;
//    printf("num = %d\n", num);
//    return 0;
//}
//-------------------------------------------------------------------------------------------------------------------

//int main()
//{
//    char arr[] = { 'b', 'i', 't' };
//    printf("%d\n", strlen(arr));
//    return 0;
//}
//-------------------------------------------------------------------------------------------------------------------

//int main()
//{
//    printf("%d\n", strlen("c:\test\121"));
//    return 0;
//}
//-------------------------------------------------------------------------------------------------------------------

/*写一个函数求两个整数的较大值
如：输入：10 20
输出较大值：20*/
//int Max(int x, int y)
//{
//    if (x > y)
//        return x;
//    else
//        return y;
//}
//
//int main()
//{
//    int a = 0;
//    int b = 0;
//    int max = 0;
//    scanf("%d %d", &a, &b);
//    max = Max(a, b);
//    printf("max=%d\n", max);
//    return 0;
//}
//-------------------------------------------------------------------------------------------------------------------

//int sum(int a)
//{
//    int c = 0;
//    static int b = 3;
//    c += 1;
//    b += 2;
//    return (a + b + c);
//}
//int main()
//{
//    int i;
//    int a = 2;
//    for (i = 0; i < 5; i++)
//    {
//        printf("%d,", sum(a));
//    }
//}
//-------------------------------------------------------------------------------------------------------------------
//小飞机
//int main()
//{
//    printf("     **     \n");
//    printf("     **     \n");
//    printf("************\n");
//    printf("************\n");
//    printf("    *  *    \n");
//    printf("    *  *    \n");
//    return 0;
//}
//-------------------------------------------------------------------------------------------------------------------
//题目描述
//判断一个整数是否能5整除。
//输入描述 :
//输入包括一个整数M（1≤M≤100, 000）。
//输出描述 :
//输出包括一行，如果M可以被5整除就输出YES，否则输出NO（结果大小写敏感）。
int main()
{
    int input = 0;
    scanf("%d", &input);
    if (input % 5 == 0)
        printf("YES");
    else
        printf("NO");
    return 0;
}